frontend/models/forms/PPForm.php

    public function run() {

        if ( $this->validate() ) {

            $order = new Order();

            $order->service_id = $this->service_id;
            $order->user_id = 0;
            $order->likes_total = $this->likes_total;
            $order->likes_ready = 0;
            $order->link = $this->link;
            $order->price = $this->_order_cost;
            $service = Services::find()->where(['id' => $this->service_id])->one();
            $order->social = Order::groupToSocial()[$service->group_id];
            $order->status = Order::STATUS_ACTIVE;
            $order->service_text = '';
            $order->api = $this->api;

            if (!$order->save(false)) {
---
INSERT INTO `orders` (`service_id`, `user_id`, `likes_total`, `likes_ready`, `link`, `price`, `social`, `status`, `service_text`, `api`) VALUES (16, 0, 50, 0, 'https://instagram.com', 0.05, 2, 1, '', 2)