frontend/models/forms/VkForm.php

    public function run() {

        if ( $this->validate() ) {

            $order = new Order();

            $type = Yii::$app->session->get('vkOrderType', false);
            $order->social = Order::SOCIAL_VK;
            $order->type = $this->type;
            $order->speed = $this->speed;
            //$order->age = $this->age;
            $order->user_id = 0;
            $order->likes_total = $this->likes_total;
            $order->likes_ready = 0;
            $order->link = $this->link;
            $order->price = $this->_order_cost;
            $order->location = $this->location;
            $order->gender = $this->gender;

            $order->status = Order::STATUS_NEW;
            $order->service_text = '';
            $order->insurance = $this->insurance;
            $order->api = Order::API_BESTLIKER;

            if (!$order->save()) {
---
INSERT INTO `orders` (`social`, `type`, `speed`, `user_id`, `likes_total`, `likes_ready`, `link`, `price`, `location`, `gender`, `status`, `service_text`, `insurance`, `api`) VALUES (1, 3, 1, 0, 50, 0, 'https://vk.com/supermotorulez', 0.05, 1, -1, 0, '', 0, 1)